ahtn/keyplus/ports/efm8/efm8/mcu/EFM8BB1/inc/SI_EFM8BB1_Devices.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  EFM8BB10F2A_QFN20
//  EFM8BB10F2G_QFN20
//  EFM8BB10F2I_QFN20
//  EFM8BB10F4A_QFN20
//  EFM8BB10F4G_QFN20
//  EFM8BB10F4I_QFN20
//  EFM8BB10F8A_QFN20
//  EFM8BB10F8G_QFN20
//  EFM8BB10F8G_QSOP24
//  EFM8BB10F8G_SOIC16
//  EFM8BB10F8I_QFN20
//  EFM8BB10F8I_QSOP24
//  EFM8BB10F8I_SOIC16

#ifndef SI_EFM8BB1_DEVICES_H
#define SI_EFM8BB1_DEVICES_H

#define EFM8BB10F2A_QFN20 0x38
#define EFM8BB10F2G_QFN20 0x08
#define EFM8BB10F2I_QFN20 0x18
#define EFM8BB10F4A_QFN20 0x35
#define EFM8BB10F4G_QFN20 0x05
#define EFM8BB10F4I_QFN20 0x15
#define EFM8BB10F8A_QFN20 0x32
#define EFM8BB10F8G_QFN20 0x02
#define EFM8BB10F8G_QSOP24 0x01
#define EFM8BB10F8G_SOIC16 0x03
#define EFM8BB10F8I_QFN20 0x12
#define EFM8BB10F8I_QSOP24 0x11
#define EFM8BB10F8I_SOIC16 0x13

#if (EFM8BB1_DEVICE == EFM8BB10F2A_QFN20)
#define DEVICE_DERIVID EFM8BB10F2A_QFN20
#define DEVICE_FLASH_SIZE 0x0800
#define DEVICE_XRAM_SIZE 0x0000
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F2G_QFN20)
#define DEVICE_DERIVID EFM8BB10F2G_QFN20
#define DEVICE_FLASH_SIZE 0x0800
#define DEVICE_XRAM_SIZE 0x0000
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F2I_QFN20)
#define DEVICE_DERIVID EFM8BB10F2I_QFN20
#define DEVICE_FLASH_SIZE 0x0800
#define DEVICE_XRAM_SIZE 0x0000
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F4A_QFN20)
#define DEVICE_DERIVID EFM8BB10F4A_QFN20
#define DEVICE_FLASH_SIZE 0x1000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F4G_QFN20)
#define DEVICE_DERIVID EFM8BB10F4G_QFN20
#define DEVICE_FLASH_SIZE 0x1000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F4I_QFN20)
#define DEVICE_DERIVID EFM8BB10F4I_QFN20
#define DEVICE_FLASH_SIZE 0x1000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F8A_QFN20)
#define DEVICE_DERIVID EFM8BB10F8A_QFN20
#define DEVICE_FLASH_SIZE 0x2000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F8G_QFN20)
#define DEVICE_DERIVID EFM8BB10F8G_QFN20
#define DEVICE_FLASH_SIZE 0x2000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F8G_QSOP24)
#define DEVICE_DERIVID EFM8BB10F8G_QSOP24
#define DEVICE_FLASH_SIZE 0x2000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QSOP24 1

#elif (EFM8BB1_DEVICE == EFM8BB10F8G_SOIC16)
#define DEVICE_DERIVID EFM8BB10F8G_SOIC16
#define DEVICE_FLASH_SIZE 0x2000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_SOIC16 1

#elif (EFM8BB1_DEVICE == EFM8BB10F8I_QFN20)
#define DEVICE_DERIVID EFM8BB10F8I_QFN20
#define DEVICE_FLASH_SIZE 0x2000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QFN20 1

#elif (EFM8BB1_DEVICE == EFM8BB10F8I_QSOP24)
#define DEVICE_DERIVID EFM8BB10F8I_QSOP24
#define DEVICE_FLASH_SIZE 0x2000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_QSOP24 1

#elif (EFM8BB1_DEVICE == EFM8BB10F8I_SOIC16)
#define DEVICE_DERIVID EFM8BB10F8I_SOIC16
#define DEVICE_FLASH_SIZE 0x2000
#define DEVICE_XRAM_SIZE 0x0100
#define DEVICE_PKG_SOIC16 1

#endif

#endif // SI_EFM8BB1_DEVICES_H

//-eof--------------------------------------------------------------------------

